Assignment with first Dataset

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('mine.csv')

use the head() method  To see the first few rows of your data

In [5]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

Using the Tail () method   To see the last few rows of your data

In [6]:
df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

Using the info() method    This will show the column names, their data types, and the count of non-null values in each column.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

Using the  Dropna() method
To remove rows with missing values

In [8]:
df.dropna()

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

 Using the  Fillna() method  To fill missing values with a specific value, tis will replace all missing values with 0

In [9]:
df.fillna(0)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

Use the appropriate methods to remove Wrong data

If a column has incorrect numeric values, you can use the to_numeric() method to convert them to numeric format, and any non-convertible values will be assigned as NaN

In [10]:
import pandas as pd
pd.to_numeric(df['Duration'], errors='coerce')

0      60
1      60
2      60
3      45
4      45
       ..
164    60
165    60
166    60
167    75
168    75
Name: Duration, Length: 169, dtype: int64

In [11]:
df.head # to check for the changes after removing the wrong data

<bound method NDFrame.head of      Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]>

use the appropriate methods to remove Wrong formats

For example If you have a column with incorrect date formats, you can use the to_datetime() method to convert them to datetime format, and any non-convertible values will be assigned as NaT (Not a Time):

In [12]:
df['Pulse'] = pd.to_datetime(df['Pulse'])

use the appropriate methods to remove Duplicates

To remove the duplicate rows, you can use the drop_duplicates()

In [13]:
df = df.drop_duplicates()

use the appropriate methods to Perform some correlation

In [14]:
correlation = df.corr()

In [15]:
print(correlation)

          Duration  Maxpulse  Calories
Duration  1.000000  0.003578  0.923053
Maxpulse  0.003578  1.000000  0.195309
Calories  0.923053  0.195309  1.000000

Assignment with Second Dataset

In [16]:
df2 = pd.read_csv('work.csv')

use the head() method To see the first few rows of your data

In [17]:
df2.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

Using the Tail () method To see the last few rows of your data

In [18]:
df2.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

Using the info() method This will show the column names, their data types, and the count of non-null values in each column.

In [19]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes

Using the Dropna() method To remove rows with missing values

In [20]:
data = df2.dropna()
print(data)

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

Using the Fillna() method To fill missing values with a specific value, tis will replace all missing values with 0

In [21]:
data.fillna(0)

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

Use the appropriate methods to remove Wrong data If a column has incorrect numeric values, you can use the to_numeric() method to convert them to numeric format, and any non-convertible values will be assigned as NaN

use the appropriate methods to remove Wrong formats  For example If you have a column with incorrect date formats, you can use the to_datetime() method to convert them to datetime format, and any non-convertible values will be assigned as NaT (Not a Time):

In [31]:
pd.to_numeric(data["py-score"], errors='coerce')

0    90.0
1    75.0
2     NaN
4    94.0
6    84.0
Name: py-score, dtype: float64

To remove the duplicate rows, you can use the drop_duplicates()

In [35]:
data.drop_duplicates()

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

use the appropriate methods to Perform some correlation

In [36]:
corr = data.corr()